export const Data = [
    {q:'다른 사람과 이야기 할 때 더 많이 듣는 편이다?',a:[{answer:'아니요.제가 주로 말 하는 편',type:'E'},{answer:'네.제가 주로 듣는 편',type:'I'}]},
    {q:'당일 갑자기 잡히는 약속이 반갑다?',a:[{answer:'번개 모임 좋음.갑자기 만나는게 더 재밌다',type:'E'},{answer:'갑자기 만나는 모임은 부담스러움.최소 몇 일 전에 약속하고 만나는게 좋음',type:'I'}]},
    {q:'밖에서 일 볼게 많을 경우,일부러 여러날에 나눠서 끝낸다?',a:[{answer:'네.',type:'E'},{answer:'아니요',type:'I'}]},
    {q:'아무 생각하지 마',a:[{answer:'응 아무 생각 안할게',type:'S'},{answer:'아무 생각하지 말라고? 그럼 일단 백지를 상상하자',type:'N'}]},
    {q:'공부하기 싫을 때',a:[{answer:'범위가 줄었으면 좋겠다',type:'S'},{answer:'시험을 왜 봐야 하는 거지 시험이 없어지는 시대도 올까?',type:'N'}]},
    {q:'만약 내가 회사 팀장이라면',a:[{answer:'할 일을 구체적으로 지시해줘야 편함 ',type:'S'},{answer:'방향만 제시하고 맡겨줘야 편함',type:'N'}]},
    {q:'누군가 본인을 싫어하는 걸 알았을때',a:[{answer:'왜 나를 싫어해?(순수한 궁금증)싫어하든지 말든지',type:'T'},{answer:'나를 왜 싫어하지?내가 기분나쁘게 한적 있나?',type:'F'}]},
    {q:'약속에 늦었을 때',a:[{answer:'늦은 이유를 얘기하는 게 중요하다',type:'N'},{answer:'오자마자 약속에 늦은 이유를 대면 더 화난다. 변명하는 것 같아 보이고 미안해 하는 기색이 보이지 않아서',type:'F'}]},
    {q:'우리 헤어져',a:[{answer:'이유가 뭐야?',type:'T'},{answer:'내가 잘못했어 다시 잘해보자',type:'F'}]},
    {q:'친구들을 집에 초대할 때',a:[{answer:'음식이 모자라지는 않을까?',type:'J'},{answer:'글쎄? 모자라면 시켜 먹지 뭐',type:'P'}]},
    {q:'여행 계획을 세울 때',a:[{answer:'공항에서 숙소까지 얼마나 걸릴까?',type:'J'},{answer:'숙소에 가서 짐을 풀고 시간을 확인해보자',type:'P'}]},
    {q:'예상치 못한 일로 계획이 틀어졌을 때',a:[{answer:'갑자기 스트레스가 확 밀려온다',type:'J'},{answer:'그럴 수도 있지 생각하고 넘긴다',type:'P'}]},
]

 //dictionary는 key,value의 pair로 저장하여, 리스트에서 인덱스로 접근하는 거와 다르게 key의 값으로 접근하여, 원하는 값을 찾을때 빠르게 찾을 수 있다는 장점