export const Data = [
    {q:'창캐미는 친구들이랑 재미있게 놀고왔어요. 집에오면서 창캐미는?',a:[{answer:'우와아! 내 에너지를 다 충전하고 온 느낌이군!',type:'E'},{answer:'우와!재밌었다! 근데 이제 좀 쉬자.. 충전은 집에서..',type:'I'}]},
    {q:'창캐미가 새로운 친구들을 만났어요. 창캐미는 대화를 먼저 시작할까요?',a:[{answer:'난 어색한거 싫어. 먼저 대화할래!',type:'E'},{answer:'나한테 말걸어 주라아..',type:'I'}]},
    {q:'창캐미가 밖에 나갔어요! 창캐미가 바깥에 바깥에 있으면?',a:[{answer:'난 밖이 좋아좋아! 에너지가 충전된다.',type:'E'},{answer:'아..집에갈래에..에너지가 소모된다.',type:'I'}]},
    {q:'창캐미는 생각을 하다가 고민에 빠졌어요. ',a:[{answer:'생각을 멈춰야겠어! (진짜 아무 생각 안하기 가능)',type:'S'},{answer:'생각을 어떻게 멈추지? 아무 생각을 안한다고? 그러면 생각을 쓰레기통에 버려야하나?',type:'N'}]},
    {q:'창캐미가 노래를 듣고 있어요. 창캐미가 노래들을 때 중요한건 가사 or 멜로디?',a:[{answer:'난 멜로디만 들려🎵',type:'S'},{answer:'난 가사를 정독해야해 !',type:'N'}]},
    {q:'창캐미가 친구에게 줄 선물을 고르고 있어요. 창캐미는?',a:[{answer:'친구가 가장 필요할 거 같은 선물을 사줘야지!',type:'S'},{answer:'실용성은 없지만 예쁘고 기억에 남을만한 선물을 사줄래!',type:'N'}]},
    {q:'어머! 창캐미 친구가 사고가 났다고 하네요! 창캐미의 반응?',a:[{answer:'병원은 갔어? 왜 사고 났어?',type:'T'},{answer:'헐! 어쩌다가? 괜찮아?',type:'F'}]},
    {q:'창캐미가 어려운 결정을 해야해요! 어떤 선택을 할까요?',a:[{answer:'이익과 손해를 따져 논리적으로 결정한다.',type:'T'},{answer:'논리나 이성보다는 가슴이 시키는대로 결정한다.',type:'F'}]},
    {q:'창캐미의 친구가 약속에 늦었어요. 창캐미 친구가 열심히 이유를 설명하네요. 이때 창캐미의 반응은?',a:[{answer:'이유가 타당하면 늦어도 괜찮아!',type:'T'},{answer:'약속에 늦은걸 변명하지마!',type:'F'}]},
    {q:'창캐미는 친구들과 여행을 떠나기로 했어요!',a:[{answer:'계획을 짜고 정해진대로 움직이는게 맞다',type:'J'},{answer:'가다 보면 그게 계획이고 놀다보면 재미있으면 된다',type:'P'}]},
    {q:'창캐미가 다이어리를 샀어요! 다이어리를 사용할 때 창캐미는?',a:[{answer:'매년 너덜너덜해질 때까지 꽉 채워 사용한다!',type:'J'},{answer:'매년 사놓지만 5장 이상 작성하기 힘들어...',type:'P'}]},
    {q:'창캐미가 예상치 못한 일로 계획이 틀어졌어요. 이때, 창캐미는?',a:[{answer:'갑자기 스트레스가 확 밀려온다.',type:'J'},{answer:'그럴 수도 있지 생각하고 넘긴다.',type:'P'}]},
]

 //dictionary는 key,value의 pair로 저장하여, 리스트에서 인덱스로 접근하는 거와 다르게 key의 값으로 접근하여, 원하는 값을 찾을때 빠르게 찾을 수 있다는 장점